const PanchangData = {
    festivals2026: {
        1: {
            1: "ईस्वी सन् नव वर्ष (New Year)",
            2: "व्रत पूर्णिमा",
            5: "परमहंस योगानंद जयंती",
            10: "सावित्री बा फुले जयंती",
            12: "राष्ट्रीय युवा दिवस",
            13: "लोहड़ी उत्सव",
            14: "मकर संक्रांति",
            19: "Bhisma Ekadashi",
            23: "बसंत पंचमी",
            26: "Republic Day",
            29: "जया एकादशी",
            31: "गुरु हरराय जयंती"
        },
        2: {
            1: "माघ पूर्णिमा",
            12: "स्वामी दयानंद सरस्वती जयंती",
            15: "महाशिवरात्रि",
            17: "फाल्गुन अमावस्या"
        },
        3: {
            3: "होली (Dhulandi)",
            10: "शीतला अष्टमी",
            19: "गुड़ी पड़वा (Gudi Padwa)",
            21: "गौरी पूजा (Gangaur)",
            27: "राम नवमी (Ram Navami)",
            31: "हनुमान जयंती"
        },
        4: {
            13: "वैशाखी",
            14: "अम्बेडकर जयंती",
            20: "अक्षय तृतीया"
        },
        5: {
            1: "बुद्ध पूर्णिमा, कूर्म अवतार",
            3: "नारद जयंती",
            13: "अपरा एकादशी व्रत",
            15: "शिव चतुर्दशी व्रत",
            16: "वट सावित्री अमावस्या व्रत",
            18: "चन्द्रदर्शन",
            20: "विनायकी चतुर्थी व्रत",
            26: "गंगा दशहारा",
            27: "निर्जला/कमला एकादशी",
            28: "प्रदोष व्रत",
            30: "ज्येष्ठ पूर्णिमा, वट पूर्णिमा"
        },
        6: {
            16: "आषाढ़ एकादशी (Devshayani)",
            30: "गुरु पूर्णिमा"
        },
        7: {
            26: "प्रदोष व्रत"
        },
        8: {
            15: "स्वतंत्रता दिवस (Independence Day)",
            16: "रक्षा बंधन",
            25: "कृष्ण जन्माष्टमी",
            28: "भाद्रपद अमावस्या"
        },
        9: {
            15: "गणेश चतुर्थी (Ganesh Chaturthi)",
            26: "अनंत चतुर्दशी"
        },
        10: {
            2: "गांधी जयंती",
            11: "दशहरा (Vijayadashami)",
            20: "करवा चौथ",
            31: "नरक चतुर्दशी"
        },
        11: {
            8: "दीपावली (Diwali)",
            9: "गोवर्धन पूजा",
            10: "भाई दूज",
            16: "छठ पूजा",
            20: "देवोत्थान एकादशी",
            24: "कार्तिक पूर्णिमा"
        },
        12: {
            25: "क्रिसमस (Christmas)"
        }
    }
};
